{
  "main-page": {
    "hero.subheadline-part-1": "Hallo, ich bin",
    "hero.contact-button": "Zum Portfolio",
    "about-me": {
      "headline": "Über mich",
      "card-part-1": "Mich begeistert, in der Softwareentwicklung meine Kreativität mit meiner Vorliebe für Struktur und Logik zu verbinden. So arbeite ich mit einer Kombination aus Analyse und Intuition, um stimmige interaktive Designs umzusetzen.",
      "card-part-2": "Erkunde meine Seite weiter, um mehr zu erfahren oder schreibe mir direkt.",
      "contact-button": "Zum Kontakt",
      "about-me-overlay": {
        "title": "Mehr über mich",
        "bp-1": "Team Player",
        "bp-2": "Immer am Lernen",
        "bp-3": "Klare Kommunikation",
        "bp-4": "In München daheim"
      }
    },
    "skills": {
      "headline": "Kernkompetenzen",
      "description": "Mit TypeScript und Angular realisiere ich dynamische Single-Page-Anwendungen. Auch ohne Frameworks entwickle ich in Vanilla JavaScript responsive und interaktive Software. Ich setze dabei ansprechende Designs mit modernem HTML und CSS um.",
      "growth-mindset": {
        "title": "Weiterentwicklung ist essentiell",
        "text": "Für meine Projekte lerne ich immer gerne neue Technologien. Besonders interessiere ich mich für:"
      }
    },
    "portfolio": {
      "headline": "Meine Projekte",
      "text": "Hier sammle ich meine besten Arbeiten. Probiere sie gerne selbst aus!",
      "project": {
        "learning-join": "Meine wichtigste Erfahrung in Join war die Umsetzung der Firebase-Anbindung für Login- und Datenbankfunktionen. Mithilfe von Services und Observables konnte ich sie für das Team in allen Komponenten verfügbar machen.",
        "learning-el-pollo-loco": "Hier habe ich ein tieferes Verständnis für die Strukturierung eines Projekts mit vielen Objekten entwickelt. Besonders das Zusammenspiel der Klassen auf unterschiedlichen Ebenen wurde für mich dabei viel klarer.",
        "learning-pokedex": "Bei der Arbeit mit einer REST-API habe ich gelernt, mit asynchronen Funktionen auf tief verschachtelte Datenstrukturen zuzugreifen.",
        "description-join": "Ein vom Kanban-Prinzip inspiriertes Organisationstool. Per Drag & Drop lassen sich Aufgaben erstellen, verschieben, zuweisen und kategorisieren.",
        "description-el-pollo-loco": "Ein objektorientiert entwickeltes 2D-Jump’n’Run-Spiel, das per Canvas dargestellt wird. Besiege Gegner, sammle Flaschen und tritt im Endkampf gegen den Boss an.",
        "description-pokedex": "Interaktiver Pokédex mit Daten der PokéAPI. Durchsuche Pokémon nach Typ, sieh dir Details an und entdecke animierte Werte und Sprites.",
        "button-previous": "<< Vorheriges Projekt",
        "button-next": "Nächstes Projekt >>"
      }
    },
    "references": {
      "headline": "Das sagen meine Kollegen über mich",
      "colleague-quote": {
        "quote-1": "Es war mir eine Freude, mit Simon zusammenzuarbeiten. Seine Stärke liegt eindeutig im logischen Denken. In herausfordernden Situationen konnte er stets hervorragende Lösungen finden. Auch die Kommunikation mit ihm war jederzeit klar, zuverlässig und angenehm.",
        "role-1": "Teamkollege",
        "quote-2": "Die Zusammenarbeit mit Simon war für mich echt eine super Erfahrung. Er war total engagiert, hat immer mitgedacht und super zuverlässig gearbeitet. Vor allem seine kreativen Ideen haben unser Projekt richtig bereichert.",
        "role-2": "Teamkollege",
        "quote-3": "Mit Simon an unserer Website zu arbeiten hat mir sehr viel Spaß gemacht. Sein Engagement hat das Projekt wirklich nach vorne gebracht. Ich würde jederzeit noch mal ein Projekt mit ihm starten.",
        "role-3": "Teamkollege"
      },
      "button-linkedin": "Zum Linkedin Profil >>"
    },
    "contact": {
      "headline": "Kontakt herstellen",
      "tagline": "Schreibe mir eine Nachricht!",
      "text": "Ich freue mich auf Austausch zu Ideen, gemeinsamen Projekten und Anregungen. Gerne beantworte ich auch deine Fragen.",
      "form": {
        "name-title": "Wie heißt du?",
        "name-placeholder": "Vor- & Nachname",
        "name-placeholder-warning": "Ups, dein Name fehlt",
        "email-title": "Wie ist deine Email?",
        "email-placeholder": "deine@email.com",
        "email-placeholder-warning": "Hoppla! Deine Email wird benötigt",
        "message-title": "Wie kann ich dir helfen?",
        "message-placeholder": "Beschreibe dein Anliegen",
        "message-placeholder-warning": "Was möchtest du mir mitteilen?",
        "checkbox-text-1": "Ich habe die",
        "checkbox-text-2": "Datenschutzerklärung",
        "checkbox-text-3": "gelesen und bin einverstanden mit der Verarbeitung meiner Daten.",
        "name-warning": "Ist dein Name so kurz?",
        "email-warning": "Deine Email scheint unvollständig zu sein.",
        "message-warning": "Bitte gib mir etwas mehr Informationen in deiner Nachricht mit.",
        "checkbox-warning": "Bitte akzeptiere die Datenschutzerklärung.",
        "button": "Nachricht senden"
      }
    }
  },
  "overlays": {
    "email-feedback-overlay": {
      "message-head": "Erfolgreich",
      "message-head-error": "Fehlgeschlagen",
      "message-body": "Deine Nachricht wurde gesendet.",
      "message-body-error": "Deine Nachricht konnte nicht gesendet werden."
    },
    "menu-overlay": {
      "link-about-me": "Über Mich",
      "link-skills": "Skills",
      "link-portfolio": "Portfolio",
      "link-references": "Referenzen",
      "link-contact": "Kontakt"
    }
  }
}
