{
  "main-page": {
    "hero.subheadline-part-1": "Hello there, I'm",
    "hero.contact-button": "My Projects",
    "about-me": {
      "headline": "About Me",
      "card-part-1": "For me, software development is the perfect way to combine my creativity with my passion for structure and logic. When I code, it feels like building with Lego as a kid without instructions, guided only by a picture on the back of the box.",
      "card-part-2": "I enjoy working in small, agile teams and value long-term collaboration.",
      "contact-button": "Contact Me",
      "about-me-overlay": {
        "title": "More about me",
        "bp-1": "An eye for detail",
        "bp-2": "Continuously learning",
        "bp-3": "Clear Communicator",
        "bp-4": "Based in Munich"
      }
    },
    "skills": {
      "headline": "Core Competencies",
      "description": "I build dynamic single-page applications with TypeScript and Angular. I also develop responsive and interactive software without frameworks, using vanilla JavaScript. For that, I create appealing designs with modern HTML and CSS.",
      "growth-mindset": {
        "title": "In Focus",
        "text": "I’m currently expanding my stack with:"
      }
    },
    "portfolio": {
      "headline": "My Work",
      "text": "Here I collect my best projects – feel free to try them out!",
      "project": {
        "learning-join": "My most important experience in Join was implementing the Firebase integration for login and database functions. Using services, signals and observables, I made them available to the team across all components.",
        "learning-el-pollo-loco": "This is where I developed a deeper understanding of how to structure a project involving many objects. In particular, the interaction between classes across different levels became much clearer to me.",
        "learning-pokedex": "While working with a REST API, I learned how to use asynchronous functions to access deeply nested data structures.",
        "description-join": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
        "description-pokedex": "Interactive Pokédex using PokéAPI data. Search Pokémon by name, view details, and explore animated stats and sprites.",
        "description-el-pollo-loco": "2D jump-and-run game built with JavaScript and canvas. Battle enemies, collect bottles, and defeat the final boss with strategic timing.",
        "button-previous": "<< Previous project",
        "button-previous-mobile": "<< Previous",
        "button-next": "Next project >>",
        "button-next-mobile": "Next >>"
      }
    },
    "references": {
      "headline": "What My Colleagues Say About Me",
      "colleague-quote": {
        "quote-1": "It was a pleasure working with Simon. His strength clearly lies in logical thinking. Even in challenging situations, he consistently found excellent solutions. Communication with him was always clear, reliable, and pleasant.",
        "role-1": "Team Colleague",
        "quote-2": "I was impressed by Simons ability to keep a clear overview of the project at all times. His strong communication skills helped the team stay coordinated and motivated, and his attention to detail ensured that the final result met high standards. A reliable and thoughtful collaborator!",
        "role-2": "Team Colleague",
        "quote-3": "Our collaboration on the website was both effective and fun. Simon's commitment really pushed the project forward. I'd happily start another project with him anytime.",
        "role-3": "Team Colleague",
        "quote-4": "Working with Simon was a truly great experience. He was fully committed, always thought ahead, and worked with impressive reliability. His creative input, in particular, really enriched our project.",
        "role-4": "Team Colleague"
      },
      "button-linkedin": "To Linkedin profile >>"
    },
    "contact": {
      "headline": "Get in Touch with Me",
      "tagline": "Feel free to send me a message!",
      "text": "I look forward to exchanging ideas, talking about projects, or hearing your suggestions. I’ll be happy to answer your questions as well.",
      "form": {
        "name-title": "What's your name?",
        "name-placeholder": "First- & Lastname",
        "name-placeholder-warning": "Oops! It seems your name is missing",
        "email-title": "What's your email?",
        "email-placeholder": "your@email.com",
        "email-placeholder-warning": "Hoppla! your email is required",
        "message-title": "How can I help you?",
        "message-placeholder": "Descripe what you are interested in",
        "message-placeholder-warning": "What’s on your mind?",
        "checkbox-text-1": "I've read the",
        "checkbox-text-2": "privacy policy",
        "checkbox-text-3": "and agree to the processing of my data.",
        "name-warning": "Is your name really that short?",
        "email-warning": "Your email seems incomplete.",
        "message-warning": "Please include a bit more detail in your message.",
        "checkbox-warning": "Please accept the privacy policy.",
        "button": "Drop a Line"
      }
    }
  },
  "overlays": {
    "email-feedback-overlay": {
      "message-head": "Success",
      "message-head-error": "Error",
      "message-body": "Your message has been sent.",
      "message-body-error": "Your message could not be sent."
    },
    "menu-overlay": {
      "link-about-me": "About Me",
      "link-skills": "Skills",
      "link-portfolio": "Projects",
      "link-references": "References",
      "link-contact": "Contact Me"
    }
  }
}
