{
  "main-page": {
    "hero.subheadline-part-1": "Hello there, I'm",
    "hero.contact-button": "Get in Touch",
    "about-me": {
      "headline": "About Me",
      "card-part-1": "Hi, I'm Simon. I really enjoy how coding lets me create smart, reusable solutions. In my last team project, for example, I achieved this by creating global SCSS variables and mixins that helped maintain consistent styling across all Angular components. I've also completed eight projects on my own, but I enjoy even more how individual strengths come together when working in small teams.",
      "card-part-2": "Let's connect and build something new together!",
      "contact-button": "Let's talk",
      "about-me-overlay": {
        "title": "More about me",
        "bp-1": "Team Player",
        "bp-2": "Continuosly learning",
        "bp-3": "Creative Thinker",
        "bp-4": "Based in Munich",
        "bp-5": "Open to work remote"
      }
    },
    "skills": {
      "headline": "Core Competencies",
      "description": "I really enjoy working with Angular. Its modularity and structure focused on reusability suit me perfectly. Still, I also enjoy writing all the classes myself in vanilla JavaScript, like I did in my browser game “El Pollo Loco”.",
      "growth-mindset": {
        "title": "Don't see the skill you are looking for?",
        "text": "Feel free to contact me. I look forward to expanding on my previous knowledge. Also I have a special interest in learning:"
      }
    },
    "portfolio": {
      "headline": "My Work",
      "text": "Take a look at a selection of my projects – You'll get the best sense of my skills by exploring my work yourself.",
      "project": {
        "learning-join": "I learned the most during Join by integrating Firebase using services and observables.",
        "learning-el-pollo-loco": "This is where I developed a deeper understanding of how to structure a project involving many objects. In particular, the interaction between classes across different levels became much clearer to me.",
        "learning-pokedex": "While working with the API, I learned how to use asynchronous functions to access deeply nested data structures.",
        "description-join": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
        "description-pokedex": "Interactive Pokédex with data from the PokéAPI. Browse Pokémon by type, view details, and explore animated stats and sprites.",
        "description-el-pollo-loco": "2D jump-and-run game built with JavaScript and canvas. Battle enemies, collect bottles, and defeat the final boss with strategic timing.",
        "button-previous": "<< Previous project",
        "button-next": "Next project >>"
      }
    },
    "references": {
      "headline": "What my colleagues say about me",
      "colleague-quote": {
        "quote-1": "It was a pleasure working with Simon. His strength clearly lies in logical thinking. Even in challenging situations, he consistently found excellent solutions. Communication with him was always clear, reliable, and pleasant.",
        "role-1": "Team Colleague",
        "quote-2": "Working with Simon was a truly great experience. He was fully committed, always thought ahead, and worked with impressive reliability. His creative input, in particular, really enriched our project.",
        "role-2": "Team Colleague",
        "quote-3": "Our collaboration on the website was both effective and fun. Simon's commitment really pushed the project forward. I'd happily start another project with him anytime.",
        "role-3": "Team Colleague"
      },
      "button-linkedin": "To Linkedin profile >>"
    },
    "contact": {
      "headline": "Together we can achieve more!",
      "tagline": "Facing a challenge?",
      "text": "In a collaborative project, we’ll make it work. I can bring your software design to life and implement interactive logic.",
      "form": {
        "name-title": "What's your name?",
        "name-placeholder": "Your name goes here",
        "name-placeholder-warning": "Oops! It seems your name is missing",
        "email-title": "What's your email?",
        "email-placeholder": "youremail@email.com",
        "email-placeholder-warning": "Hoppla! your email is required",
        "message-title": "How can I help you?",
        "message-placeholder": "Hello Simon, I am interested in...",
        "message-placeholder-warning": "What do you need to develop?",
        "checkbox-text-1": "I've read the",
        "checkbox-text-2": "privacy policy",
        "checkbox-text-3": "and agree to the processing of my data.",
        "name-warning": "Is your name really that short?",
        "email-warning": "Your email seems incomplete.",
        "message-warning": "Please include a bit more detail in your message.",
        "checkbox-warning": "Please accept the privacy policy.",
        "button": "Drop a Line"
      }
    }
  }
}
